Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Thrown if the Java Virtual Machine cannot find an appropriate native-language definition of a method declared native.
zh_cn: 当 Java 虚拟机无法找到声明为 native 的方法的适当本地语言定义时，抛出该错误。

source: Thrown if the Java Virtual Machine or a ClassLoader instance tries to load in the definition of a class (as part of a normal method call or as part of creating a new instance using the new expression) and no definition of the class could be found.
zh_cn: 当 Java 虚拟机或 ClassLoader 实例试图在类的定义中加载（作为通常方法调用的一部分或者作为使用 new 表达式创建的新实例的一部分），但无法找到该类的定义时，抛出此错误。

source: Thrown to indicate some unexpected internal error has occurred in the Java Virtual Machine.
zh_cn: 该错误指示 Java 虚拟机中出现一些意外的内部错误。

source: Thrown to indicate that a HTTP request needs to be retried but cannot be retried automatically, due to streaming mode being enabled.
zh_cn: 抛出此异常指示 HTTP 请求需要重试，但由于启用了流模式而无法自动重试。

source: Thrown to indicate that a malformed URL has occurred.
zh_cn: 抛出这一异常指示出现了错误的 URL。

source: Thrown to indicate that a method has been passed an illegal or inappropriate argument.
zh_cn: 抛出的异常表明向方法传递了一个不合法或不正确的参数。

source: Thrown to indicate that a program has attempted to access an element of an annotation type that was added to the annotation type definition after the annotation was compiled (or serialized).
zh_cn: 若某个注释在编译（或序列化）后将某个注释类型添加到其类型定义中，而程序试图该注释类型的元素时，抛出此异常。

source: Thrown to indicate that a program has attempted to access an element of an annotation whose type has changed after the annotation was compiled (or serialized).
zh_cn: 若某个注释的类型在对该注释进行编译（或序列化）后发生了更改，而程序试图访问该注释的元素时，抛出此异常。

source: Thrown to indicate that a thread has attempted to wait on an object's monitor or to notify other threads waiting on an object's monitor without owning the specified monitor.
zh_cn: 抛出的异常表明某一线程已经试图等待对象的监视器，或者试图通知其他正在等待对象的监视器而本身没有指定监视器的线程。

source: Thrown to indicate that a thread is not in an appropriate state for the requested operation.
zh_cn: 指示线程没有处于请求操作所要求的适当状态时抛出的异常。

source: Thrown to indicate that an array has been accessed with an illegal index.
zh_cn: 用非法索引访问数组时抛出的异常。

source: Thrown to indicate that an assertion has failed.
zh_cn: 抛出该错误指示某个断言失败。

source: Thrown to indicate that an attempt has been made to store the wrong type of object into an array of objects.
zh_cn: 试图将错误类型的对象存储到一个对象数组时抛出的异常。

source: Thrown to indicate that an index of some sort (such as to an array, to a string, or to a vector) is out of range.
zh_cn: 指示某排序索引（例如对数组、字符串或向量的排序）超出范围时抛出。

source: Thrown to indicate that an operation could not complete because the input did not conform to the appropriate XML document type for a collection of properties, as per the Properties specification.
zh_cn: 当按照 Properties 规范，输入内容不符合属性集的正确 XML 文档类型，从而无法完成操作时，抛出此异常。

source: Thrown to indicate that an unknown service exception has occurred.
zh_cn: 抛出这一异常指示出现了未知服务异常。

source: Thrown to indicate that the clone method in class Object has been called to clone an object, but that the object's class does not implement the Cloneable interface.
zh_cn: 当调用 Object 类中的 clone 方法复制对象，但该对象的类无法实现 Cloneable 接口时，抛出该异常。

source: Thrown to indicate that the IP address of a host could not be determined.
zh_cn: 指示主机 IP 地址无法确定而抛出的异常。

source: Thrown to indicate that the Java Virtual Machine is broken or has run out of resources necessary for it to continue operating.
zh_cn: 当 Java 虚拟机崩溃或用尽了它继续操作所需的资源时，抛出该错误。

source: Thrown to indicate that the application has attempted to convert a string to one of the numeric types, but that the string does not have the appropriate format.
zh_cn: 当应用程序试图将字符串转换成一种数值类型，但该字符串不能转换为适当格式时，抛出该异常。

source: Thrown to indicate that the code has attempted to cast an object to a subclass of which it is not an instance.
zh_cn: 当试图将对象强制转换为不是实例的子类时，抛出该异常。

source: Thrown to indicate that the requested operation is not supported.
zh_cn: 当不支持请求的操作时，抛出该异常。

source: Thrown to indicate that there is an error creating or accessing a Socket.
zh_cn: 抛出此异常指示在创建或访问一个 Socket 时存在错误。

source: Thrown to indicate that there is an error in the underlying protocol, such as a TCP error.
zh_cn: 抛出此异常指示在底层协议中存在错误，如 TCP 错误。

source: Thrown when a particular method cannot be found.
zh_cn: 无法找到某一特定方法时，抛出该异常。

source: Thrown when a semantically malformed parameterized type is encountered by a reflective method that needs to instantiate it.
zh_cn: 当反射方法遇到语义错误的参数化类型，而反射方法需要实例化该类型时，抛出该异常。

source: Thrown when a serious I/O error has occurred.
zh_cn: 当发生严重的 I/O 错误时，抛出此错误。

source: Thrown when a stack overflow occurs because an application recurses too deeply.
zh_cn: 当应用程序递归太深而发生堆栈溢出时，抛出该错误。

source: Thrown when a syntactically malformed signature attribute is encountered by a reflective method that needs to interpret the generic signature information for a type, method or constructor.
zh_cn: 当需要解释类型、方法或构造方法的一般签名信息的反射方法遇到语法错误的签名属性时，抛出该错误。

source: Thrown when a thread is waiting, sleeping, or otherwise occupied, and the thread is interrupted, either before or during the activity.
zh_cn: 当线程在活动之前或活动期间处于正在等待、休眠或占用状态且该线程被中断时，抛出该异常。

source: Thrown when an application attempts to use null in a case where an object is required.
zh_cn: 当应用程序试图在需要对象的地方使用 null 时，抛出该异常。

source: Thrown when an application tries to access a type using a string representing the type's name, but no definition for the type with the specified name can be found.
zh_cn: 当应用程序试图使用表示类型名称的字符串对类型进行访问，但无法找到带有指定名称的类型定义时，抛出该异常。

source: Thrown when an application tries to access an enum constant by name and the enum type contains no constant with the specified name.
zh_cn: 当应用程序试图通过名称和枚举类型访问那些不包含具有指定名称的常量的枚举常量时，抛出该异常。

source: Thrown when an application tries to call an abstract method.
zh_cn: 当应用程序试图调用一个抽象方法时，抛出此错误。

source: Thrown when an application tries to create an instance of a class using the newInstance method in class Class, but the specified class object cannot be instantiated.
zh_cn: 当应用程序试图使用 Class 类中的 newInstance 方法创建一个类的实例，而指定的类对象无法被实例化时，抛出该异常。

source: Thrown when an application tries to load in a class through its string name using:
zh_cn: 当应用程序试图使用以下方法通过字符串名加载类时，抛出该异常：

source: Thrown when an application tries to use the Java new construct to instantiate an abstract class or an interface.
zh_cn: 当应用程序试图使用 Java 的 new 结构来实例化一个抽象类或一个接口时，抛出该错误。

source: Thrown when an exceptional arithmetic condition has occurred.
zh_cn: 当出现异常的运算条件时，抛出此异常。

source: Thrown when an incompatible class change has occurred to some class definition.
zh_cn: 在某些类定义中出现不兼容的类更改时抛出该错误。

source: Thrown when an instance is required to have a Serializable interface.
zh_cn: 当实例需要具有序列化接口时，抛出此异常。

source: Thrown when an unknown but serious exception has occurred in the Java Virtual Machine.
zh_cn: 当 Java 虚拟机中出现一个未知但严重的异常时，抛出该错误。

source: Thrown when control information that was read from an object stream violates internal consistency checks.
zh_cn: 当从对象流中读取的控制信息与内部一致性检查相冲突时，抛出此异常。

source: Thrown when serialization or deserialization is not active.
zh_cn: 当序列化和反序列化不活动时，抛出此异常。

source: Thrown when the "verifier" detects that a class file, though well formed, contains some sort of internal inconsistency or security problem.
zh_cn: 当“校验器”检测到一个类文件虽然格式正确，但包含着一些内部不一致性或安全性问题时，抛出该错误。

source: Thrown when the Java Virtual Machine attempts to read a class file and determines that the file is malformed or otherwise cannot be interpreted as a class file.
zh_cn: 当 Java 虚拟机试图读取类文件并确定该文件存在格式错误或无法解释为类文件时，抛出该错误。

source: Thrown when the Java Virtual Machine attempts to read a class file and determines that the major and minor version numbers in the file are not supported.
zh_cn: 当 Java 虚拟机试图读取一个类文件，并确定文件的主辅版本号不受支持时，抛出该错误。

source: Thrown when the Java Virtual Machine cannot allocate an object because it is out of memory, and no more memory could be made available by the garbage collector.
zh_cn: 因为内存溢出或没有可用的内存提供给垃圾回收器时，Java 虚拟机无法分配一个对象，这时抛出该错误。

source: Thrown when the Java Virtual Machine detects a circularity in the superclass hierarchy of a class being loaded.
zh_cn: 当 Java 虚拟机检测类的超类层次的循环加载抛出。

source: Thrown when the Serialization runtime detects one of the following problems with a Class.
zh_cn: 当 Serialization 运行时检测到某个类具有以下问题之一时，抛出此异常。

source: Thrown when the annotation parser attempts to read an annotation from a class file and determines that the annotation is malformed.
zh_cn: 当注释解析器试图从类文件读取注释并确定注释出现异常时，抛出该错误。

source: Throws CloneNotSupportedException.
zh_cn: 抛出 CloneNotSupportedException。

source: Thus the length (in chars) of the text range is endIndex-beginIndex.
zh_cn: 因此文本范围的长度（char 形式）为 endIndex-beginIndex。

source: Thus the methods are not strictly guaranteed to be non-blocking -- a thread may block transiently before performing the operation.
zh_cn: 因而，该方法不能严格保证不被阻塞 - 执行操作之前可能暂时阻塞线程。

source: Thus, in the face of concurrent modification, the iterator fails quickly and cleanly, rather than risking arbitrary, non-deterministic behavior at an undetermined time in the future.
zh_cn: 因此，面对并发的修改，迭代器很快就会完全失败，而不冒在将来不确定的时间发生任意不确定行为的风险。

source: Thus, it's very important not to set the initial capacity too high (or the load factor too low) if iteration performance is important.
zh_cn: 所以，如果迭代性能很重要，则不要将初始容量设置得太高（或将加载因子设置得太低）。

source: Thus, no more than corePoolSize threads will ever be created.
zh_cn: 这样，创建的线程就不会超过 corePoolSize。

source: Thus, on return from the wait method, the synchronization state of the object and of thread T is exactly as it was when the wait method was invoked.
zh_cn: 所以，从 wait 方法返回时，该对象和线程 T 的同步状态与调用 wait 方法时的情况完全相同。

source: Thus, the order of the high-low surrogates is never reversed.
zh_cn: 因此，高-低代理项的顺序不会反转。

source: Thus, this method performs a "shallow copy" of this object, not a "deep copy" operation.
zh_cn: 所以，此方法执行的是该对象的“浅表复制”，而不“深层复制”操作。

source: Tie-breaking utility for ordering insertions when equal hashCodes and non-comparable.
zh_cn: 相同的 hashCodes 非不可比较的时候，用于排序插入的打断实用方法。

source: Timing
zh_cn: 计时

source: To achieve this independence, it may be necessary to modify one or more fields of the object returned by super.clone before returning it.
zh_cn: 要获得此独立性，在 super.clone 返回对象之前，有必要对该对象的一个或多个字段进行修改。

source: To ameliorate impact, when keys are Comparable, this class may use comparison order among keys to help break ties.
zh_cn: 为了改善影响，当键是 Comparable，这个类可以使用键之间的比较，以帮助打破僵局。

source: To avoid compatibility issues, the names of Condition methods are different from the corresponding Object versions.
zh_cn: 为了避免兼容性问题，Condition 方法的名称与对应的 Object 版本中的不同。

source: To be useful across a wide range of contexts, this class provides many adjustable parameters and extensibility hooks.
zh_cn: 为了便于跨大量上下文使用，此类提供了很多可调整的参数和扩展钩子 (hook)。

source: To create a proxy for some interface Foo:
zh_cn: 创建某一接口 Foo 的代理：

source: To determine the class(es) referred to, the Java virtual machine invokes the loadClass method of the class loader that originally created the class.
zh_cn: 为了确定引用的类，Java 虚拟机将调用最初创建该类的类加载器的 loadClass 方法。

source: To help ensure portability of Java programs, the definitions of some of the numeric functions in this package require that they produce the same results as certain published algorithms.
zh_cn: 为了确保 Java 程序的可移植性，此包中的某些数学函数的定义需要与某些已发布的算法生成相同的结果。

source: To start a process with an explicit set of environment variables, first call Map.clear() before adding environment variables.
zh_cn: 要利用一组明确的环境变量启动进程，在添加环境变量之前，首先调用 Map.clear()。

source: To wait "forever", you can use a value of Long.MAX_VALUE.
zh_cn: 要“永远”等待，可以使用 Long.MAX_VALUE 值。

source: Tree bins (i.e., bins whose elements are all TreeNodes) are ordered primarily by hashCode, but in the case of ties, if two elements are of the same "class C implements Comparable", type then their compareTo method is used for ordering.
zh_cn: Tree bins （即 TreeNode 的 bin）主要通过 hashCode 排序，但如果两个元素都是相同的 "class C implements Comparable"，将会使用它们的 compareTo 方法来排序。

source: Tree version of putVal.
zh_cn: 树版本的 putVal。

source: Tries to remove from the work queue all Future tasks that have been cancelled.
zh_cn: 尝试从工作队列移除所有已取消的 Future 任务。

source: Twice the old capacity, plus 2.
zh_cn: 旧容量的两倍加 2。

source: Two ProcessBuilder instances always contain independent process environments, so changes to the returned map will never be reflected in any other ProcessBuilder instance or the values returned by System.getenv.
zh_cn: 两个 ProcessBuilder 实例总是包含独立的进程环境，因此，针对返回的映射的更改从不会在任何其他 ProcessBuilder 实例或由 System.getenv 返回的值中反映出来。

source: Two corresponding String, Class, enum, or annotation typed members whose values are x and y are considered equal if x.equals(y).
zh_cn: 如果 x.equals(y) 为真，则认为值分别为 x 和 y 的两个对应的 String、Class、enum 或 annotation 类型的成员相等。

source: Two corresponding double members whose values are x and y are considered equal if Double.valueOf(x).equals(Double.valueOf(y)).
zh_cn: 如果 Double.valueOf(x).equals(Double.valueOf(y)) 为真，则认为值分别为 x 和 y 的两个对应的 double 成员相等。

source: Two corresponding float members whose values are x and y are considered equal if Float.valueOf(x).equals(Float.valueOf(y)).
zh_cn: 如果 Float.valueOf(x).equals(Float.valueOf(y)) 为真，则认为值分别为 x 和 y 的两个对应的 float 成员相等。

source: Two corresponding array typed members x and y are considered equal if Arrays.equals(x, y), for the appropriate overloading of equals(boolean[], boolean[]).
zh_cn: 对于适当重载的 equals(boolean[], boolean[])，如果 Arrays.equals(x, y) 为真, 则认为两个对应的数组类型的成员 x 和 y 相等。

source: Two corresponding primitive typed members whose values are x and y are considered equal if x == y, unless their type is float or double.
zh_cn: 如果 x == y，则认为值分别为 x 和 y 的两个对应的基本类型成员相等，除非它们的类型是 float 或 double。

source: Two enum constants e1 and e2 are of the same enum type if and only if e1.getDeclaringClass() == e2.getDeclaringClass().
zh_cn: 当且仅当 e1.getDeclaringClass() == e2.getDeclaringClass() 时，两个枚举常量 e1 和 e2 的枚举类型才相同。

source: Two stack trace elements a and b are equal if and only if:
zh_cn: 当且仅当满足下列条件时，堆栈跟踪元素 a 和 b 相同：

source: Two supplied methods, remove(Runnable) and purge() are available to assist in storage reclamation when large numbers of queued tasks become cancelled.
zh_cn: remove(Runnable) 和 purge() 这两种方法可用于在取消大量已排队任务时帮助进行存储回收。

source: Type is the common superinterface for all types in the Java programming language.
zh_cn: Type 是 Java 编程语言中所有类型的公共高级接口。

source: TypeVariable is the common superinterface for type variables of kinds.
zh_cn: TypeVariable 是各种类型变量的公共高级接口。

source: Typesafe enumeration for byte orders
zh_cn: 字节顺序的类型安全的枚举

source: Typically, an anonymous inner class will be used.
zh_cn: 通常将使用匿名内部类完成此操作。

source: Typically, it is stored in the manifest that is distributed with the classes.
zh_cn: 通常，此信息存储在与类一起分发的清单中。

source: Typically, these instances are freshly created in the context of the exceptional situation so as to include relevant information (such as stack trace data).
zh_cn: 通常，这些实例是在异常情况的上下文中新近创建的，因此包含了相关的信息（比如堆栈跟踪数据）。

source: Typically, this is the point at which the throwable corresponding to the stack trace was created.
zh_cn: 通常，这是创建对应于堆栈跟踪的 throwable 的点。

source: Typically, this means copying any mutable objects that comprise the internal "deep structure" of the object being cloned and replacing the references to these objects with references to the copies.
zh_cn: 这通常意味着要复制包含正在被复制对象的内部“深层结构”的所有可变对象，并使用对副本的引用替换对这些对象的引用。

source: Unchecked exception thrown when a character with an invalid Unicode code point as defined by isValidCodePoint(int) is passed to the Formatter.
zh_cn: 将具有 isValidCodePoint(int) 所定义的无效 Unicode 代码点的字符传递给 Formatter 时，抛出未经检查的异常。

source: Unchecked exception thrown when a content-mutation method such as put or compact is invoked upon a read-only buffer.
zh_cn: 当在只读缓冲区上调用内容可变（content-mutation）的方法（例如 put 或 compact 方法）时，抛出此未经检查的异常。

source: Unchecked exception thrown when a conversion and flag are incompatible.
zh_cn: 转换与标志不兼容时抛出未经检查的异常。

source: Unchecked exception thrown when a format string contains an illegal syntax or a format specifier that is incompatible with the given arguments.
zh_cn: 当格式字符串包含非法语法，或者包含与给定参数不兼容的格式说明符时，将抛出未经检查的异常。

source: Unchecked exception thrown when a relative get operation reaches the source buffer's limit.
zh_cn: 当相关 get 操作达到源缓冲区限制时，抛出此未经检查的异常。

source: Unchecked exception thrown when a relative put operation reaches the target buffer's limit.
zh_cn: 当相关 put 操作达到目标缓冲区限制时，抛出此未经检查的异常。

source: Unchecked exception thrown when an attempt is made to reset a buffer when its mark is not defined.
zh_cn: 当试图重置一个尚未定义其标记的缓冲区时，抛出此未检查的异常。

source: Unchecked exception thrown when an illegal combination flags is given.
zh_cn: 当给出非法组合标志时，抛出未经检查的异常。

source: Unchecked exception thrown when an unknown conversion is given.
zh_cn: 给定未知的转换时所抛出的未经检查的异常。

source: Unchecked exception thrown when an unknown flag is given.
zh_cn: 给定未知标志时所抛出的未经检查的异常。

source: Unchecked exception thrown when duplicate flags are provided in the format specifier.
zh_cn: 格式说明符中提供重复标志时抛出的未经检查的异常。

source: Unchecked exception thrown when the argument corresponding to the format specifier is of an incompatible type.
zh_cn: 当对应于格式说明符的参数为不兼容的类型时，抛出未经检查的异常。

source: Unchecked exception thrown when the format width is a negative value other than -1 or is otherwise unsupported.
zh_cn: 当格式宽度为除 -1 以外的负值或其他不受支持的值时，将抛出未经检查的异常。

source: Unchecked exception thrown when the format width is required.
zh_cn: 请求格式宽度时抛出未经检查的异常。

source: Unchecked exception thrown when the formatter has been closed.
zh_cn: 格式器已关闭时抛出的未经检查的异常。

source: Unchecked exception thrown when the precision is a negative value other than -1, the conversion does not support a precision, or the value is otherwise unsupported.
zh_cn: 当精度为除 -1 以外的负值、转换类型不支持某个精度或者值在其他方面不受支持时，将抛出未经检查的异常。

source: Unchecked exception thrown when there is a format specifier which does not have a corresponding argument or if an argument index refers to an argument that does not exist.
zh_cn: 如果格式说明符没有相应的参数，或者参数索引引用了不存在的参数时，则抛出未经检查的异常。

source: Undefined bidirectional character type.
zh_cn: 未定义的双向字符类型。

source: Unless otherwise noted, passing a null argument to a constructor or method in this class will cause a NullPointerException to be thrown.
zh_cn: 除非另行说明，否则将 null 参数传递给此类中的构造方法或方法将抛出 NullPointerException。

source: Unless otherwise noted, passing a null argument to a constructor or method in any class or interface in this package will cause a NullPointerException to be thrown.
zh_cn: 除非另有说明，向此包的任何类或接口中的构造方法或方法传递 null 变量，将会抛出 NullPointerException。

source: Unless otherwise specified by the implementing class, actions are performed in the order of entry set iteration (if an iteration order is specified.)
zh_cn: 除非实现类另有指定，否则按条目集迭代的顺序执行操作(如果指定了迭代顺序)。

source: Unless otherwise specified, the behavior with respect to supplementary characters and surrogate char values is as follows:
zh_cn: 除非另有指定，否则与增补字符和代理项 char 值有关的行为如下：

source: Unlike soft and weak references, phantom references are not automatically cleared by the garbage collector as they are enqueued.
zh_cn: 与软引用和弱引用不同，虚引用在加入队列时并没有通过垃圾回收器自动清除。

source: Unlike some of the numeric methods of class StrictMath, all implementations of the equivalent functions of class Math are not defined to return the bit-for-bit same results.
zh_cn: 与 StrictMath 类的某些数学方法不同，并非 Math 类所有等价函数的实现都定义为返回逐位相同的结果。

source: Unlike the other methods in this interface, this method ignores inherited annotations.
zh_cn: 与此接口中的其他方法不同，该方法将忽略继承的注释。

source: Unpaired surrogates within the text range given by index and codePointOffset count as one code point each.
zh_cn: index 和 codePointOffset 给出的文本范围内的不成对代理项是按一个代码点算作一个项进行计数的。

source: Unpaired surrogates within this sequence count as one code point each.
zh_cn: 该序列中每个未配对的代理项都被作为一个代码点进行计数。

source: Use of small queues generally requires larger pool sizes, which keeps CPUs busier but may encounter unacceptable scheduling overhead, which also decreases throughput.
zh_cn: 使用小型队列通常要求较大的池大小，CPU 使用率较高，但是可能遇到不可接受的调度开销，这样也会降低吞吐量。

source: Use of this method for any other purpose is strongly discouraged.
zh_cn: 强烈反对出于其他任何目的而使用此方法。

source: Uses the constructor represented by this Constructor object to create and initialize a new instance of the constructor's declaring class, with the specified initialization parameters.
zh_cn: 使用此 Constructor 对象表示的构造方法来创建该构造方法的声明类的新实例，并用指定的初始化参数初始化该实例。

source: Using a value of Long.MAX_VALUE NANOSECONDS effectively disables idle threads from ever terminating prior to shut down.
zh_cn: 使用 Long.MAX_VALUENANOSECONDS 的值在关闭前有效地从以前的终止状态禁用空闲线程。

source: Utility class for HTML form decoding.
zh_cn: HTML 格式解码的实用工具类。

source: Utility class for HTML form encoding.
zh_cn: HTML 格式编码的实用工具类。

source: Utility classes commonly useful in concurrent programming.
zh_cn: 在并发编程中很常用的实用工具类。

source: Virtual machine implementations are, however, encouraged to bias against clearing recently-created or recently-used soft references.
zh_cn: 然而，虚拟机实现不鼓励清除最近访问或使用过的软引用。

source: Virtually all Java core classes that implement Comparable have natural orderings that are consistent with equals.
zh_cn: 实际上，所有实现 Comparable 的 Java 核心类都具有与 equals 一致的自然排序。

source: Waits at most millis milliseconds for this thread to die.
zh_cn: 等待该线程终止的时间最长为 millis 毫秒。

source: Waits at most millis milliseconds plus nanos nanoseconds for this thread to die.
zh_cn: 等待该线程终止的时间最长为 millis 毫秒 + nanos 纳秒。

source: Waits for this thread to die.
zh_cn: 等待该线程终止。

source: Wakes up a single thread that is waiting on this object's monitor.
zh_cn: 唤醒在此对象监视器上等待的单个线程。

source: Wakes up all threads that are waiting on this object's monitor.
zh_cn: 唤醒在此对象监视器上等待的所有线程。

source: We don't require a total order, just a consistent insertion rule to maintain equivalence across rebalancings.
zh_cn: 我们不需要全部排序，只需要一个一致的插入规则来维护重新包装之间的等价关系。

source: Weak bidirectional character type "AN" in the Unicode specification.
zh_cn: Unicode 规范中的弱双向字符类型“AN”。

source: Weak bidirectional character type "BN" in the Unicode specification.
zh_cn: Unicode 规范中的弱双向字符类型“BN”。

source: Weak bidirectional character type "CS" in the Unicode specification.
zh_cn: Unicode 规范中的弱双向字符类型“CS”。

source: Weak bidirectional character type "EN" in the Unicode specification.
zh_cn: Unicode 规范中的弱双向字符类型“EN”。

source: Weak bidirectional character type "ES" in the Unicode specification.
zh_cn: Unicode 规范中的弱双向字符类型“ES”。

source: Weak bidirectional character type "ET" in the Unicode specification.
zh_cn: Unicode 规范中的弱双向字符类型“ET”。

source: Weak bidirectional character type "NSM" in the Unicode specification.
zh_cn: Unicode 规范中的弱双向字符类型“NSM”。

source: Weak bidirectional character type "PDF" in the Unicode specification.
zh_cn: Unicode 规范中的弱双向字符类型“PDF”。

source: Weak reference objects, which do not prevent their referents from being made finalizable, finalized, and then reclaimed.
zh_cn: 弱引用对象，它们并不禁止其指示对象变得可终结，并被终结，然后被回收。

source: Weak references are most often used to implement canonicalizing mappings.
zh_cn: 弱引用最常用于实现规范化的映射。

source: When a Java Virtual Machine starts up, there is usually a single non-daemon thread (which typically calls the method named main of some designated class).
zh_cn: 当 Java 虚拟机启动时，通常都会有单个非守护线程（它通常会调用某个指定类的 main 方法）。

source: When a method is invoked on a proxy instance, the method invocation is encoded and dispatched to the invoke method of its invocation handler.
zh_cn: 对代理实例调用方法时，将对方法调用进行编码并将其指派到它的调用处理程序的 invoke 方法。

source: When a new task is submitted in method execute(Runnable), and fewer than corePoolSize threads are running, a new thread is created to handle the request, even if other worker threads are idle.
zh_cn: 当新任务在方法 execute(Runnable) 中提交时，如果运行的线程少于 corePoolSize，则创建新线程来处理请求，即使其他辅助线程是空闲的。

source: When a parameterized type p is created, the generic type declaration that p instantiates is resolved, and all type arguments of p are created recursively.
zh_cn: 当创建参数化类型 p 时，p 实例化的一般类型声明会被解析，并且按递归方式创建 p 的所有类型参数。
